КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СпециальныеУсловияДвижения/КонтурЛогистика_СпециальныеУсловияДвижения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СпециальныеУсловияДвижения</name>
  <enumValues>
    <name>ОпасныйГруз</name>
  </enumValues>
  <enumValues>
    <name>КрупногабаритноеТяжеловесноеТС</name>
  </enumValues>
  <enumValues>
    <name>Иное</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СпециальныеУсловияДвижения/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗначениеДляXDTO(Значение) Экспорт
	
	Если Значение = Перечисления.КонтурЛогистика_СпециальныеУсловияДвижения.ОпасныйГруз Тогда
		
		Результат = "1";
		
	ИначеЕсли Значение = Перечисления.КонтурЛогистика_СпециальныеУсловияДвижения.КрупногабаритноеТяжеловесноеТС Тогда
		
		Результат = "2";
		
	ИначеЕсли Значение = Перечисления.КонтурЛогистика_СпециальныеУсловияДвижения.Иное Тогда
		
		Результат = "3";
		
	Иначе
		
		ВызватьИсключение "Для заполнения в xml передано неверное значение специального условия движения: " + Значение;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеИзXDTO(Значение) Экспорт
	
	Если Значение = "1" Тогда 
		
		Результат = ОпасныйГруз;
		
	ИначеЕсли Значение = "2" Тогда 
		
		Результат = КрупногабаритноеТяжеловесноеТС;
		
	ИначеЕсли Значение = "3" Тогда 
		
		Результат = Иное;
		
	Иначе		
		
		Результат = ПустаяСсылка();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
